app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons"
---
  def index
    render json: Lesson.all

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    render json: Lesson.find(params[:id])

DELETE FROM "lessons" WHERE "lessons"."id" = $1  [["id", "91f0fc85-3390-4a76-96cf-5197699311cd"]]
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def destroy
    Lesson.find(params[:id]).delete